#+Title: Samples Testadas
#+Subtitle: Notas sobre as samples


* Rodando  
  
   #+NAME:  clonando                   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      #adb devices
      cd $wkdir
      cd android-ConstraintLayoutExamples
      gradle tasks
   #+END_SRC

   #+RESULTS: clonando
   #+begin_example

   [wagner@localhost android-ConstraintLayoutExamples]$ bash: cd: android-ConstraintLayoutExamples: No such file or directory
   total 72
   -rw-rw-r--. 1 wagner wagner  1605 abr 20 18:16 build.gradle
   drwxrwxr-x. 3 wagner wagner  4096 abr 20 18:16 constraintlayout
   -rw-rw-r--. 1 wagner wagner   985 abr 20 18:16 CONTRIBUTING.md
   drwxrwxr-x. 3 wagner wagner  4096 abr 20 18:16 CycleEditor
   drwxrwxr-x. 3 wagner wagner  4096 abr 20 18:16 gradle
   -rw-rw-r--. 1 wagner wagner   783 abr 20 18:16 gradle.properties
   -rwxrwxr-x. 1 wagner wagner  4971 abr 20 18:16 gradlew
   -rw-rw-r--. 1 wagner wagner  2314 abr 20 18:16 gradlew.bat
   -rw-rw-r--. 1 wagner wagner 11361 abr 20 18:16 LICENSE
   drwxrwxr-x. 3 wagner wagner  4096 abr 20 18:16 motionlayout
   -rw-rw-r--. 1 wagner wagner 10191 abr 20 18:16 README.md
   drwxrwxr-x. 2 wagner wagner  4096 abr 20 18:16 screenshots
   -rw-rw-r--. 1 wagner wagner    44 abr 20 18:16 settings.gradle
   #+end_example
